cf/InformationRegisters/IndividualsDocuments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>IndividualsDocuments</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Series</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Number</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IssueDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ValidityPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WhoIssued</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DepartmentCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IsIdentityDocument</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Presentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DeleteDocumentKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.IndividualsDocumentsKinds</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Individuals</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DocumentKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.IndividualsDocumentsKinds</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/IndividualsDescriptionFull.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>IndividualsDescriptionFull</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Surname</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Patronymic</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Individuals</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Catalogs/Individuals.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Individuals</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Birthdate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Gender</Name>
					<Type>
						<v8:Type>cfg:EnumRef.IndividualGender</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Citizenship</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.WorldCountries</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ContactInformation</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Type</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ContactInformationTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Kind</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContactInformationKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FieldValues</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Country</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Region</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>City</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EmailAddress</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ServerDomainName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumberWithoutCodes</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonModules/PersonalDataProtectionOverridable/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Subsystem "Personal data protection".
// Module is intended to place overridable subsystem procedures.
//  
////////////////////////////////////////////////////////////////////////////////

#Region ProgramInterface

// Procedure provides collection of information about the storage of data related to personal data
//
// Parameters:
// 	InfoTable - value table with fields:
// 		Object 			- a string containing the full
// 		name of the metadata object, RegistrationFields - a string that lists the names of
// 							the registration fields, registration fields
// 							are separated by a comma, alternative - symbol
// 		"|", AccessFields		- a string that lists the names of access fields separated with commas.
// 		DataArea	- a string with data area identifier, optional.
//
Procedure FillInfoAboutPersonalData(InfoTable) Export
	
	// StandardSubsystems.Individuals
	NewInfo = InfoTable.Add();
	NewInfo.Object			= "Catalog.Individuals";
	NewInfo.LoggedFields	= "Ref";
	NewInfo.AccessFields		= "BirthDate,Gender";
	NewInfo.DataArea		= "PersonalData";
	
	// InformationRegister.IndividualsDocuments
	NewInfo = InfoTable.Add();
	NewInfo.Object			= "InformationRegister.IndividualsDocuments";
	NewInfo.LoggedFields	= "Ind";
	NewInfo.AccessFields		= "DocumentKind,Series,Number,IssueDate,ValidityPeriod,WhoIssued,DepartmentCode,Presentation";
	NewInfo.DataArea		= "PassportData";
	// End StandardSubsystems.Individuals
	
EndProcedure

// Procedure provides collections of personal data areas.
//
// Parameters:
// 	PersonalDataAreas - value table with fields:
// 		Name - data area identifier.
// 		Presentation - user presentation of the data area.
// 		Parent - identifier of the parent data area.
//
Procedure FillPersonalDataAreas(PersonalDataAreas) Export
	
	// Filling presentations for
	// used areas StandardSubsystems.Individuals
	NewArea = PersonalDataAreas.Add();
	NewArea.Name = "PersonalData";
	NewArea.Presentation = NStr("en='Personal data';ru='Персональные данные субъекта'");
	
	NewArea = PersonalDataAreas.Add();
	NewArea.Name = "PassportData";
	NewArea.Presentation = NStr("en='Passport data';ru='Паспортные данные'");
	NewArea.Parent = "PersonalData";
	// End StandardSubsystems.Individuals
	
EndProcedure

// Procedure is called when filling out the "Consent to
//  process personal data" forms with the persons' data passed as the parameters.
//
// Parameters:
// 	PersonalDataSubjects 	- collection form data containing information about persons.
// 	UpdateDate			- date on which the data must be filled.
//
Procedure AddDataToSubjectsPersonalData(PersonalDataSubjects, UpdateDate) Export
	
	For Each PersonPD IN PersonalDataSubjects Do
		
		PersonRef = PersonPD.Subject;
		If TypeOf(PersonRef) = Type("CatalogRef.Individuals") Then
			
			PersonPD.Initials = InformationRegisters.IndividualsDescriptionFull.IndividualDescriptionFull(UpdateDate, PersonRef);
			If IsBlankString(PersonPD.Initials) Then
				
				PersonPD.Initials = PersonRef.Description;
				
			EndIf;
			
			PersonPD.Address = ContactInformationManagement.ObjectContactInformation(PersonRef, Catalogs.ContactInformationTypes.IndividualAddressByRegistration);
			
			IndividualsDocuments = Catalogs.Individuals.IndividualDocumentByType(UpdateDate, PersonRef, Catalogs.IndividualsDocumentsKinds.LocalPassport);
			If IndividualsDocuments.Count() > 0 Then
				
				PersonPD.PassportData	= IndividualsDocuments[0].Presentation;
				
			EndIf;
			
		EndIf;
		
	EndDo;
	
EndProcedure

// Procedure is called when filling the "Consent to process
//  personal data" form with the company's data.
//
// Parameters:
// 	Company					- company - personal data operator.
// 	CompanyData			- structure with company's data (address, full name of responsible person, etc.).
// 	UpdateDate			- date on which the data must be filled.
//
Procedure AddCompanyDataPersonalDataOperator(Company, CompanyData, UpdateDate) Export
	
	InfoAboutCompany = SmallBusinessServer.InfoAboutLegalEntityIndividual(Company, UpdateDate);
	CompanyData.CompanyAddress = SmallBusinessServer.CompaniesDescriptionFull(InfoAboutCompany, "LegalAddress");
	
	ResponsiblePersons		= SmallBusinessServer.OrganizationalUnitsResponsiblePersons(Company, UpdateDate);
	CompanyData.ResponsibleForPersonalDataProcessing = ResponsiblePersons.Head;
	
EndProcedure

#EndRegion
